{
  "backend/main.mo": "Main Motoko actor for the Diploma Smart Study Hub backend, defining data types and state for galleries, lessons, user profiles, subscriptions, payments, files, and withdrawal requests, with Stripe configuration and access control mixins included.",
  "feature_evidence.json": "Feature evidence report listing four completed features that remove admin panel UI elements (button, dropdown, routes, and login redirect) from the student-facing frontend, each mapped to specific files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one- to two-sentence summaries of each frontend source file, describing the purpose and notable implementation details of pages, hooks, and components in the React frontend.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for the design token system (colors, radius, chart colors, sidebar) in both light and dark modes using OKLCH values.",
  "frontend/index.html": "HTML entry point for the React app titled 'Diploma Smart Study Hub', mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all student-facing routes (dashboard, branches, content, subscription, quizzes, etc.) and wraps the app in QueryClient, ThemeProvider, and Toaster providers; admin routes have been removed.",
  "frontend/src/components/admin/BulkDeleteDialog.tsx": "Alert dialog component for confirming bulk deletion of multiple content categories, displaying category names, item counts, and a destructive confirm action.",
  "frontend/src/components/admin/FileDropZone.tsx": "Drag-and-drop file upload zone component that validates files by extension and size, supporting both drag events and click-to-browse input with configurable accepted types and max size.",
  "frontend/src/components/admin/GalleryPreviewGrid.tsx": "Renders a grid of galleries with their images and videos for admin preview, supporting deletion of entire galleries or individual media items via confirmation dialogs.",
  "frontend/src/components/admin/GalleryUploadSection.tsx": "Provides a form for admins to create a new gallery with title, description, and upload images/videos, validating file types and sizes before submitting.",
  "frontend/src/components/admin/PaymentTransactionTable.tsx": "Displays a filterable table of payment transactions with status badges and payment method indicators, supporting filtering by method (Stripe/PhonePe) and status.",
  "frontend/src/components/admin/PdfPreviewDialog.tsx": "A modal dialog that renders a PDF preview using an iframe, accepting either a File object or a URL as input.",
  "frontend/src/components/admin/UploadProgressItem.tsx": "Displays a single file upload item with status icon, progress bar, upload speed, and retry/remove action buttons.",
  "frontend/src/components/admin/UserActivationDialog.tsx": "Shows an alert dialog for admins to activate an inactive user account, displaying user details and a warning before confirming activation.",
  "frontend/src/components/content/GalleryGrid.tsx": "Renders galleries of images and videos for content viewers, enforcing access control by locking media for non-subscribed users and opening a lightbox on click.",
  "frontend/src/components/content/ImageLightbox.tsx": "File content was empty; no implementation details available.",
  "frontend/src/components/content/LockedContentIndicator.tsx": "Wraps content with a blurred lock overlay and tooltip for non-subscribed, non-admin users, rendering children normally for admins or active subscribers.",
  "frontend/src/components/content/MediaLightbox.tsx": "A full-screen dialog lightbox for browsing gallery images and videos with keyboard navigation, download support, and previous/next controls.",
  "frontend/src/components/content/PaymentAuthorizationDialog.tsx": "A settings dialog that lets users enable automatic payments and configure a maximum authorized amount for subscription renewals.",
  "frontend/src/components/content/PaymentHistoryList.tsx": "Displays a paginated table of payment transaction records with status badges, formatted dates, amounts, and payment method indicators.",
  "frontend/src/components/content/PaymentQRSection.tsx": "Shows either an automatic-payment confirmation UI or a manual UPI/QR code payment section with masked UPI ID and payment details.",
  "frontend/src/components/content/SubscriptionPromptDialog.tsx": "A modal dialog prompting unauthenticated or unsubscribed users to subscribe, listing features and pricing with a navigation button to the subscription page.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with brand info, quick navigation links, resource links, subscription plan pricing, and a copyright bar with a Caffeine.ai attribution.",
  "frontend/src/components/layout/Header.tsx": "Sticky top navigation header with logo, desktop/mobile nav links (some auth-gated), and an Internet Identity login/logout button with loading state.",
  "frontend/src/components/layout/Layout.tsx": "Root layout wrapper that composes Header, a full-height main content area via React Router's Outlet, and Footer.",
  "frontend/src/hooks/useActiveSubscriptions.ts": "React Query hook that fetches all active subscriber Principals from the backend actor, caching results for 30 seconds.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous backend actor based on the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAdminCheck.ts": "React Query hook that checks whether the current authenticated user is an admin via the backend actor, with a backward-compatible useIsAdmin alias.",
  "frontend/src/hooks/useAdminPayments.ts": "React Query hook that fetches all payment records from the backend actor and returns them sorted by timestamp descending.",
  "frontend/src/hooks/useContentAccess.ts": "Composable hook that derives whether the current user has content access by combining admin status and subscription status checks.",
  "frontend/src/hooks/useFileManagement.ts": "Collection of React Query mutation hooks for deleting files, video links, important links, individual categories, and bulk-deleting categories, each invalidating relevant query caches on success.",
  "frontend/src/hooks/useFileUpload.ts": "Hook managing a client-side upload queue with per-file progress/speed tracking and a mutation that simulates chunked upload progress before calling the backend bulk upload method.",
  "frontend/src/hooks/useGalleryContent.ts": "React Query hooks for fetching galleries filtered by category path parameters (branch/semester/subject/chapter) or by a specific gallery ID from the backend actor.",
  "frontend/src/hooks/useGalleryManagement.ts": "Provides React Query mutation hooks for gallery CRUD operations including creating galleries, uploading/deleting images and videos, and deleting galleries, each with toast notifications on success or error.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/usePaymentAuthorization.ts": "Provides hooks to fetch and update payment authorization settings (auto-payment toggle and max amount), with the update mutation currently stubbed out pending backend implementation.",
  "frontend/src/hooks/usePaymentConfirmation.ts": "Exports hooks for finalizing a Stripe checkout session and creating a new checkout session, handling subscription activation and URL generation for success/cancel redirects.",
  "frontend/src/hooks/usePaymentHistory.ts": "Fetches the caller's payment records from the backend, sorts them by timestamp descending, and returns them alongside loading and fetched state.",
  "frontend/src/hooks/usePhonePePayment.ts": "Provides hooks to fetch the backend UPI ID, mask it for display, and initiate a PhonePe/UPI payment by constructing a deep link for mobile or showing instructions on desktop.",
  "frontend/src/hooks/useQueries.ts": "Exports hooks to fetch and save the current caller's user profile using React Query, with query invalidation on successful save.",
  "frontend/src/hooks/useSubscription.ts": "Polls the backend every 30 seconds to check whether the current user's subscription is active, returning a boolean query result.",
  "frontend/src/hooks/useUserActivation.ts": "Provides a mutation hook to activate a user account by Principal, invalidating subscription and user-related queries and showing toast feedback on completion.",
  "frontend/src/hooks/useWithdrawal.ts": "Exports hooks for submitting a withdrawal request (with phone and amount validation), fetching all withdrawal requests, and fetching a single withdrawal request by ID.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles, imports Google Fonts (Inter and Poppins), and sets up a deep navy and amber color theme with CSS custom properties for both light and dark modes.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders a static About page describing the Diploma Smart Study Hub's mission, features (comprehensive content, focused learning, community, recognition), and reasons to choose the platform.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin-only dashboard showing earnings stats and a withdrawal request dialog with amount and phone number validation; redirects non-admins away with an error toast.",
  "frontend/src/pages/admin/ContentManagementPage.tsx": "Admin-only page for managing gallery content, allowing selection of branch, semester, subject, and chapter to upload or preview educational gallery items. Redirects non-admins to the dashboard.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Admin-only page for viewing and managing user subscriptions, payments, and activations with stats cards and a payment transaction table. Redirects non-admins to the dashboard.",
  "frontend/src/pages/BranchSelectionPage.tsx": "Displays a grid of engineering branch cards (CSE, ECE, EEE, MECH, CIVIL, CHEM, Other) and navigates to the semester selection page for the chosen branch on click.",
  "frontend/src/pages/CertificatesPage.tsx": "Shows a list of mock earned certificates with title, date, and score, each with a download button; displays an empty state with a 'Start Learning' CTA when no certificates exist.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form (name, email, message) that shows a success toast on submission, alongside static contact information cards for email, phone, and location.",
  "frontend/src/pages/ContentBrowserPage.tsx": "Displays branch/semester study materials (PDFs and videos) fetched via useGalleryContent, enforces subscription-based access with a lock prompt, and organizes content into tabbed galleries.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the authenticated student dashboard showing subscription status, user profile info, and a grid of engineering branches for quick navigation to course content.",
  "frontend/src/pages/HomePage.tsx": "Landing page for DiplomaHub displaying a hero section, engineering branch cards, feature highlights, and subscription pricing plans. Handles navigation to login or dashboard based on authentication state.",
  "frontend/src/pages/LeaderboardPage.tsx": "Authenticated page showing a ranked leaderboard of students by score, downloads, and quizzes completed, with weekly/monthly/all-time tabs and the current user's rank card.",
  "frontend/src/pages/LoginPage.tsx": "Login page that authenticates users via Internet Identity, redirecting to the dashboard on success and handling already-authenticated edge cases with a re-login flow.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Static page shown after a failed payment, listing common failure reasons and providing buttons to retry the subscription or return to the dashboard.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Page shown after a successful Stripe checkout that reads the session_id from the URL, calls the payment confirmation mutation, and displays a loading or success state with navigation options.",
  "frontend/src/pages/ProfilePage.tsx": "Authenticated profile page displaying static user account information (email, roll number, join date) and study statistics (downloads, quiz average, study hours).",
  "frontend/src/pages/QuizListPage.tsx": "Displays a list of mock quizzes with subject, question count, duration, and completion status. Allows users to start or retake quizzes, navigating to the dashboard on action.",
  "frontend/src/pages/QuizPage.tsx": "Placeholder quiz page that shows a 'coming soon' message with a back button navigating to the dashboard.",
  "frontend/src/pages/RemindersPage.tsx": "Study reminders page that lists mock reminders (exams, assignments, study sessions) and provides a dialog form to create new reminders with type, date, time, and notes fields.",
  "frontend/src/pages/SemesterSelectionPage.tsx": "Displays a grid of 8 semesters for a given branch, showing subject previews and focus-level badges, and navigates to the content page on selection.",
  "frontend/src/pages/SubscriptionPage.tsx": "Subscription page offering weekly, monthly, and half-yearly plans; initiates a Stripe checkout session via backend hooks and redirects the user to the payment URL.",
  "frontend/src/utils/fileValidation.ts": "Utility functions for validating file and video size/type limits (50MB for files, 100MB for videos) and formatting file sizes and upload speeds.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (navy, amber, success, warning), fonts, border radii, box shadows, and animations for the project's design system.",
  "project_state.json": "Project state tracking file recording existing completed features and a pending request to remove the admin panel from the website across dashboard, header, router, and login page."
}