{
  "backend/main.mo": "Main ICP actor implementing the backend for a study hub app, including gallery management, lessons, user profiles, subscriptions, payments (Stripe), withdrawals, and file/video/link storage with access control and blob storage mixins.",
  "backend/migration.mo": "Migration module defining the old actor state shape (lessons, galleries, payments, subscriptions, etc.) and a no-op `run` function that passes existing state through unchanged.",
  "feature_evidence.json": "Feature evidence report mapping three Razorpay-related frontend features (payment hook, subscription page integration, admin transaction table badge) to their implementation files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of frontend source files, describing each page, hook, and component's purpose and notable implementation details.",
  "frontend/index.css": "Global Tailwind CSS file defining CSS custom properties for a neutral light/dark color theme used across the app's UI components and sidebar.",
  "frontend/index.html": "HTML entry point for the 'Diploma Smart Study Hub' React app, mounting the app into a `#root` div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all app routes (home, dashboard, branches, content, subscription, payment, quizzes, etc.), wraps authenticated routes in an `AuthGuard`, and provides QueryClient and theme context.",
  "frontend/src/components/admin/BulkDeleteDialog.tsx": "An alert dialog component that confirms bulk deletion of multiple categories, displaying each category name and item count as destructive badges along with the total item count.",
  "frontend/src/components/admin/FileDropZone.tsx": "A drag-and-drop file upload zone component that validates files by type and size, supporting both drag-and-drop and click-to-browse interactions.",
  "frontend/src/components/admin/GalleryPreviewGrid.tsx": "Displays a grid of galleries with their images and videos, providing delete functionality for individual galleries, images, and videos via confirmation dialogs.",
  "frontend/src/components/admin/GalleryUploadSection.tsx": "A form component for creating a new gallery with a title, description, and uploading images and videos, organized under a specific branch/semester/subject/chapter hierarchy.",
  "frontend/src/components/admin/PaymentTransactionTable.tsx": "A filterable table component that displays payment transaction records with status and payment method badges, supporting filtering by method (Stripe, Razorpay, PhonePe/QR) and status.",
  "frontend/src/components/admin/PdfPreviewDialog.tsx": "A dialog component that renders a PDF preview inside an iframe, accepting either a File object or a URL as the source.",
  "frontend/src/components/admin/UploadProgressItem.tsx": "A single file upload progress row component that shows status icons, a progress bar with upload speed, error messages, and retry/remove action buttons.",
  "frontend/src/components/admin/UserActivationDialog.tsx": "A dialog component for admins to activate inactive user accounts, showing user details and a warning before confirming activation via the useUserActivation hook.",
  "frontend/src/components/content/GalleryGrid.tsx": "Displays a grid of gallery media items (images and videos) with access control, opening a MediaLightbox on click and showing a locked state for non-subscribed, non-admin users.",
  "frontend/src/components/content/ImageLightbox.tsx": "Empty file with no content.",
  "frontend/src/components/content/LockedContentIndicator.tsx": "Wraps children with a blurred lock overlay and tooltip for non-admin, non-subscribed users, passing through content unchanged for authorized users.",
  "frontend/src/components/content/MediaLightbox.tsx": "A full-screen dialog lightbox for navigating and downloading gallery images and videos, supporting keyboard arrow-key navigation and displaying current item index.",
  "frontend/src/components/content/PaymentAuthorizationDialog.tsx": "A settings dialog allowing users to enable automatic payments and set a maximum authorized amount, loading and saving configuration via usePaymentAuthorization hooks.",
  "frontend/src/components/content/PaymentHistoryList.tsx": "Renders a table of payment transaction records with status badges, formatted dates, amounts, and payment method, handling loading and empty states.",
  "frontend/src/components/content/PaymentQRSection.tsx": "Displays a payment UI section that shows either an automatic payment confirmation (when auto-pay is enabled) or a manual QR code scan interface with masked UPI ID and amount details.",
  "frontend/src/components/content/SubscriptionPromptDialog.tsx": "A modal dialog that prompts unauthenticated or unsubscribed users to subscribe, listing features and pricing tiers (₹5/week, ₹29/month, ₹99/6 months) with a navigation button to the subscription page.",
  "frontend/src/components/layout/Footer.tsx": "Site footer with brand info, quick navigation links, resource links, and subscription plan pricing, plus a copyright line and a Caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Sticky top navigation header with logo, desktop/mobile nav links (conditionally shown based on auth state), and an Internet Identity login/logout button.",
  "frontend/src/components/layout/Layout.tsx": "Root layout wrapper that composes the Header, a main content area rendered via TanStack Router's Outlet, and the Footer.",
  "frontend/src/hooks/useActiveSubscriptions.ts": "React Query hook that fetches all active subscriber Principals from the backend actor, with 30-second cache and actor-readiness gating.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useAdminCheck.ts": "Hook that queries the backend to determine if the current user is an admin, with a backward-compatible `useIsAdmin` alias returning a simplified boolean result.",
  "frontend/src/hooks/useAdminPayments.ts": "React Query hook that fetches all payment records from the backend and returns them sorted by timestamp descending, intended for admin use.",
  "frontend/src/hooks/useContentAccess.ts": "Composable hook that combines admin and subscription status to expose a single `hasAccess` boolean indicating whether the current user can view gated content.",
  "frontend/src/hooks/useFileManagement.ts": "Collection of React Query mutation hooks for deleting files, video links, important links, individual categories, and bulk-deleting categories, each invalidating relevant query caches and showing toast notifications.",
  "frontend/src/hooks/useFileUpload.ts": "Provides a `useFileUpload` hook that manages a file upload queue with progress tracking, status updates, and retry logic, calling the backend `bulkUpload` method via an actor mutation.",
  "frontend/src/hooks/useGalleryContent.ts": "Exports React Query hooks for fetching galleries filtered by category (branch/semester/subject/chapter) and by individual gallery ID from the backend actor.",
  "frontend/src/hooks/useGalleryManagement.ts": "Exports mutation hooks for creating, deleting, and uploading images/videos to galleries via the backend actor, with toast notifications and query cache invalidation on each operation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context provider and `useInternetIdentity` hook using DFINITY's AuthClient, managing login status, identity persistence, and delegation validation.",
  "frontend/src/hooks/usePaymentAuthorization.ts": "Provides hooks to fetch and update payment authorization settings (auto-payment toggle and max amount), with the mutation currently throwing a not-implemented error as the backend is pending.",
  "frontend/src/hooks/usePaymentConfirmation.ts": "Exports hooks to finalize a Stripe checkout session by session ID and to create a new Stripe checkout session with success/cancel redirect URLs via the backend actor.",
  "frontend/src/hooks/usePaymentHistory.ts": "Fetches the caller's payment records from the backend, sorts them by timestamp descending, and exposes them with loading/fetched state helpers.",
  "frontend/src/hooks/usePhonePePayment.ts": "Provides hooks to fetch the backend UPI ID, mask it for display, and initiate a PhonePe/UPI payment by constructing a deep link on mobile or showing instructions on desktop.",
  "frontend/src/hooks/useQueries.ts": "Exports hooks to fetch the current caller's user profile and to save/update it via the backend actor, with query cache invalidation on successful save.",
  "frontend/src/hooks/useRazorpayPayment.ts": "Custom hook that loads the Razorpay checkout script and exposes a mutation to initiate a payment flow, then invalidates subscription-related queries on success.",
  "frontend/src/hooks/useSubscription.ts": "Custom hook that queries the backend actor to check if the current user's subscription is active, polling every 30 seconds.",
  "frontend/src/hooks/useUserActivation.ts": "Custom hook that exposes a mutation to activate a user account by Principal via the backend actor, invalidating relevant admin and subscription queries on success.",
  "frontend/src/hooks/useWithdrawal.ts": "Provides three hooks for withdrawal operations: submitting a new withdrawal request with validation, fetching all withdrawal requests, and fetching a single withdrawal request by ID.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind directives, imports Google Fonts, and defines CSS custom properties for a deep navy and amber academic color theme with light and dark mode variants.",
  "frontend/src/lib/utils.ts": "Utility module exporting a `cn` helper that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in TanStack QueryClientProvider and a custom InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Static About page describing the platform's mission, features (comprehensive content, focused learning, community, recognition), and reasons to choose the service.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin-only dashboard showing earnings stats and a withdrawal request dialog with amount and phone number validation, guarded by admin role checks.",
  "frontend/src/pages/admin/ContentManagementPage.tsx": "Admin-only page for managing educational content, allowing selection of branch, semester, subject, and chapter to upload or preview gallery content.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Admin-only page displaying active subscriptions, payment transactions, and user activation controls across tabbed views with role-based access enforcement.",
  "frontend/src/pages/BranchSelectionPage.tsx": "Page displaying a grid of engineering branches (CSE, ECE, EEE, etc.) as clickable cards that navigate to the corresponding semester selection route.",
  "frontend/src/pages/CertificatesPage.tsx": "Page that displays a user's earned certificates as cards with score and download option, falling back to an empty state with a call-to-action if none exist.",
  "frontend/src/pages/ContactPage.tsx": "A contact page with a message submission form (name, email, message) and static contact information (email, phone, address). On submit, it shows a success toast and resets the form.",
  "frontend/src/pages/ContentBrowserPage.tsx": "Displays study materials (PDFs and videos) for a specific branch and semester, gating premium content behind a subscription check and showing a prompt dialog for non-subscribers.",
  "frontend/src/pages/DashboardPage.tsx": "Student dashboard showing the user's subscription status, profile info, and quick-navigation cards for all engineering branches and semesters.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page featuring a hero section, branch grid, feature highlights, and subscription plan cards (Weekly, Monthly, Half-Yearly) with navigation to auth and content pages.",
  "frontend/src/pages/LeaderboardPage.tsx": "A leaderboard page (requires authentication) displaying ranked users by score, downloads, and quizzes completed, with weekly/monthly/all-time tab views and the current user's rank card.",
  "frontend/src/pages/LoginPage.tsx": "Renders the DiplomaHub login page with Internet Identity authentication, redirecting authenticated users to the dashboard and handling login errors with toast notifications.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure screen with common failure reasons and buttons to retry the subscription or return to the dashboard.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Handles post-payment confirmation by extracting the Stripe session ID from the URL, calling the payment confirmation hook, and showing a success state with navigation options.",
  "frontend/src/pages/ProfilePage.tsx": "Shows a static user profile page with account information and study statistics, redirecting unauthenticated users to the login page.",
  "frontend/src/pages/QuizListPage.tsx": "Displays a list of mock quizzes with subject, duration, and completion status, allowing users to start or retake each quiz.",
  "frontend/src/pages/QuizPage.tsx": "Placeholder quiz page that displays a 'coming soon' message and a back button navigating to the dashboard.",
  "frontend/src/pages/RemindersPage.tsx": "Renders a study reminders page with a list of mock reminders and a dialog form to create new reminders for exams, assignments, or study sessions.",
  "frontend/src/pages/SemesterSelectionPage.tsx": "Displays a grid of 8 semesters for a selected branch, showing subject lists and focus-level badges, with navigation to branch selection and content pages.",
  "frontend/src/pages/SubscriptionPage.tsx": "Renders subscription plan options (weekly, monthly, half-yearly) and handles payment initiation via both Stripe and Razorpay, redirecting unauthenticated users to login.",
  "frontend/src/utils/fileValidation.ts": "Provides utility functions for validating file size, video size, file type, and video type, along with helpers for formatting file sizes and upload speeds.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (navy, amber, success/warning), fonts, border radii, box shadows, and animations for the frontend.",
  "project_state.json": "Tracks project state and feature requests for a subscription payment integration, including existing Razorpay frontend/backend features and pending implementation tasks using the live Razorpay key."
}