{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Razorpay Payment Integration for Subscriptions",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add frontend hooks for Razorpay payment flow",
      "acceptanceCriteria": [
        "useRazorpayPayment hook creates a Razorpay order via backend and opens the Razorpay checkout modal",
        "On successful payment, verifyRazorpayPayment is called and subscription is activated",
        "Payment failure shows an error toast with a retry option",
        "Hook is reusable from the SubscriptionPage"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useRazorpayPayment.ts",
          "operation": "create",
          "description": "Create a custom hook that manages the Razorpay payment flow. The hook should: (1) Dynamically load the Razorpay checkout script from https://checkout.razorpay.com/v1/checkout.js using a script tag. (2) Expose a `initiateRazorpayPayment` mutation function that accepts a subscription plan type and amount. (3) Call the backend `createRazorpayOrder` function to generate a Razorpay order ID. (4) Open the Razorpay checkout modal with order details (order_id, amount, currency INR, company name). (5) Handle the success handler by calling backend `verifyRazorpayPayment` with razorpay_order_id, razorpay_payment_id, and razorpay_signature. (6) Invalidate subscription-related queries on success. (7) Handle payment failure and modal dismissal by setting error state. (8) Return loading, error, and success states to the caller. Use React Query's useMutation for backend calls and useState for modal state management."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update SubscriptionPage to include Razorpay payment option alongside Stripe",
      "acceptanceCriteria": [
        "Each subscription plan card on SubscriptionPage shows a 'Pay with Razorpay' button",
        "Clicking the button opens the Razorpay checkout modal with the correct plan amount in INR",
        "After payment success the user is redirected to the dashboard with a subscription active toast",
        "The existing Stripe checkout button remains functional and unmodified",
        "Loading state is shown on the button while the Razorpay order is being created"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SubscriptionPage.tsx",
          "operation": "modify",
          "description": "Add Razorpay payment buttons alongside the existing Stripe 'Subscribe Now' buttons for each plan card (weekly, monthly, half-yearly). Import and use the useRazorpayPayment hook. For each plan card, add a 'Pay with Razorpay' button that triggers the Razorpay checkout flow with the plan amount converted to INR (use appropriate conversion rate or display amounts directly in INR). Show a loading spinner on the button while the Razorpay order is being created. On successful payment, show a success toast ('Subscription activated successfully!') and navigate to the dashboard using the router. On payment failure, show an error toast with a retry option. Ensure the existing Stripe button and flow remain unchanged. Use a two-button layout or button group to present both payment options clearly."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update PaymentTransactionTable to display Razorpay transactions and filter option",
      "acceptanceCriteria": [
        "PaymentTransactionTable filter dropdown includes 'Razorpay' as a filterable method",
        "Razorpay transactions are displayed with a distinct Razorpay badge consistent with existing method badges"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/PaymentTransactionTable.tsx",
          "operation": "modify",
          "description": "Add 'Razorpay' as a payment method option in the filter dropdown alongside the existing 'Stripe' and 'PhonePe' options. Update the payment method badge rendering logic to display a distinct Razorpay badge (e.g., badge with purple or blue color scheme) when a transaction's payment method is 'razorpay'. Ensure the badge styling is consistent with the existing Stripe and PhonePe method badges. The backend PaymentRecord type should already support storing the payment method; use that field to determine which badge to display. If the payment method field does not exist, coordinate with backend to ensure Razorpay transactions are tagged appropriately."
        }
      ]
    }
  ]
}