{
  "backend/main.mo": "Main backend actor implementing gallery, lesson, user profile, subscription, payment, withdrawal, and file management with Stripe integration, access control, and blob storage mixins.",
  "backend/migration.mo": "Migration module that transforms old state with mcfPhoneNumber to new state with phonePePaymentsUPI (9392412728-2@axl), bankAccountNumber, and ifscCode fields.",
  "feature_evidence.json": "Feature evidence report documenting the requirement to hide or mask the UPI ID '9392412728-2@axl' in frontend payment UI components.",
  "frontend-file-summaries.txt": "Summaries of frontend files showing payment pages, subscription components, and hooks that reference phone number 9392412728 and handle PhonePe payment flows.",
  "frontend/index.css": "Global CSS defining design tokens in OKLCH color space with forest green and teal palette for light and dark modes.",
  "frontend/index.html": "HTML entry point for 'Diploma Smart Study Hub' application with root div and module script reference.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with routes for home, dashboard, admin, payment success/failure, content browsing, quizzes, and user management pages.",
  "frontend/src/components/admin/BulkDeleteDialog.tsx": "Alert dialog component for confirming bulk deletion of categories with item counts, showing destructive warning and loading states.",
  "frontend/src/components/admin/FileDropZone.tsx": "A drag-and-drop file upload component that validates file types and sizes, accepts multiple files, and provides visual feedback during drag operations.",
  "frontend/src/components/admin/GalleryPreviewGrid.tsx": "Displays a grid of galleries with their images and videos, providing delete functionality for galleries and individual media items with confirmation dialogs.",
  "frontend/src/components/admin/GalleryUploadSection.tsx": "Handles gallery creation and media uploads (images and videos) with validation, progress tracking, and tabbed interface for organizing content by branch, semester, subject, and chapter.",
  "frontend/src/components/admin/PaymentTransactionTable.tsx": "Displays a filterable table of payment transactions with status badges, supporting both PhonePe/QR and Stripe payment methods with date formatting and status indicators.",
  "frontend/src/components/admin/PdfPreviewDialog.tsx": "A modal dialog component that renders PDF previews in an iframe, accepting either a File object or URL as input.",
  "frontend/src/components/admin/UploadProgressItem.tsx": "Displays individual file upload progress with status icons, progress bars, upload speed, and retry/remove actions for failed or pending uploads.",
  "frontend/src/components/admin/UserActivationDialog.tsx": "A confirmation dialog for activating user accounts, displaying user details and warnings about unlocking study materials access.",
  "frontend/src/components/content/GalleryGrid.tsx": "Displays a grid of gallery items (images and videos) with locked/unlocked states based on user subscription or admin status, and opens a lightbox on media click.",
  "frontend/src/components/content/ImageLightbox.tsx": "Empty file with no content.",
  "frontend/src/components/content/LockedContentIndicator.tsx": "Wraps content with a lock overlay and tooltip for non-subscribed/non-admin users, showing a blur effect and lock icon to indicate restricted access.",
  "frontend/src/components/content/MediaLightbox.tsx": "Full-screen dialog component for viewing gallery images and videos with navigation controls, keyboard shortcuts, and download functionality.",
  "frontend/src/components/content/PaymentHistoryList.tsx": "Displays a table of payment transactions with status badges, payment methods, amounts, and timestamps, showing loading or empty states as needed.",
  "frontend/src/components/content/PaymentQRSection.tsx": "Shows a PhonePe QR code for UPI payment with payment details (amount, UPI ID, phone number) and step-by-step instructions for completing the transaction.",
  "frontend/src/components/content/SubscriptionPromptDialog.tsx": "Modal dialog that prompts non-subscribed users to subscribe, listing benefits and displaying the ₹5/week pricing with a call-to-action button.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with branding, navigation links (Quick Links, Resources), social media icons, and copyright information including a privacy policy link.",
  "frontend/src/components/layout/Header.tsx": "Header component with logo, navigation menu, theme toggle, notifications, and authentication controls; includes mobile menu support and admin badge display.",
  "frontend/src/components/layout/Layout.tsx": "Main layout wrapper component that renders Header, main content outlet, and Footer in a flex column structure.",
  "frontend/src/hooks/useActiveSubscriptions.ts": "React Query hook that fetches all active subscriptions from the backend actor, returning an array of Principal IDs.",
  "frontend/src/hooks/useActor.ts": "Core hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token.",
  "frontend/src/hooks/useAdminCheck.ts": "Hook that queries the backend to check if the current user has admin privileges, with 5-minute cache.",
  "frontend/src/hooks/useAdminPayments.ts": "Hook for admins to fetch all payment records from the backend, sorted by timestamp in descending order.",
  "frontend/src/hooks/useContentAccess.ts": "Hook that determines content access based on subscription status or admin role, managing a prompt dialog for unauthorized access attempts.",
  "frontend/src/hooks/useFileManagement.ts": "Provides mutation hooks for deleting files, video links, important links, categories, and bulk category deletion with query invalidation and toast notifications.",
  "frontend/src/hooks/useFileUpload.ts": "Manages file upload queue with progress tracking, speed calculation, and bulk upload mutation to backend with status updates and error handling.",
  "frontend/src/hooks/useGalleryContent.ts": "Provides hooks to fetch galleries by category filters (branch, semester, subject, chapter) and retrieve individual gallery by ID.",
  "frontend/src/hooks/useGalleryManagement.ts": "Provides React Query mutations for gallery CRUD operations including creating galleries, uploading images/videos, and deleting galleries or individual media items, with toast notifications and query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider for ICP, managing login state, identity persistence, and auth client lifecycle with configurable options.",
  "frontend/src/hooks/usePaymentConfirmation.ts": "Provides a mutation hook to finalize Stripe checkout sessions, activate subscriptions, and invalidate related queries with success/error toast notifications.",
  "frontend/src/hooks/usePaymentHistory.ts": "Fetches and sorts the caller's payment records from the backend actor, returning them in descending timestamp order with loading states.",
  "frontend/src/hooks/usePhonePePayment.ts": "Manages PhonePe UPI payments by fetching UPI ID from backend, generating UPI deep links for mobile payments, and providing UPI ID masking utility for display.",
  "frontend/src/hooks/useSubscription.ts": "Queries the backend actor to check if the user's subscription is active, with automatic refetching every 30 seconds to keep status synchronized.",
  "frontend/src/hooks/useUserActivation.ts": "Provides a mutation to activate user accounts by Principal ID, invalidating multiple subscription and user-related queries upon success with toast notifications.",
  "frontend/src/hooks/useWithdrawal.ts": "Manages withdrawal requests with mutations for submitting requests (with validation for amount and phone number) and queries for fetching all or individual withdrawal requests.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom color palette using OKLCH color space for light and dark themes, featuring forest green, sage, and teal accent colors.",
  "frontend/src/lib/utils.ts": "Exports a utility function `cn` that combines clsx and tailwind-merge for conditional and conflict-free CSS class name merging.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component into the root DOM element.",
  "frontend/src/pages/AboutPage.tsx": "Displays the About page with mission statement, feature cards (comprehensive content, focused learning, community, recognition), and reasons to choose the platform for diploma students.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard with withdrawal request functionality, requiring admin permissions check. Displays stats cards and allows admins to submit withdrawal requests with phone number validation (minimum ₹50).",
  "frontend/src/pages/admin/ContentManagementPage.tsx": "Admin content management interface for uploading and managing gallery content organized by branch, semester, subject, and chapter. Includes admin permission checks and dynamic subject filtering based on selected branch.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Admin page component for managing users, displaying active subscriptions, payment transactions, and user activation controls with admin permission checks.",
  "frontend/src/pages/BranchSelectionPage.tsx": "Shows a grid of engineering branch cards (CSE, ECE, EEE, Mechanical, Civil, Other) with icons and descriptions, linking to branch-specific content pages.",
  "frontend/src/pages/CertificatesPage.tsx": "Displays user's earned certificates with download functionality, requires authentication, and shows empty state if no certificates exist.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form for users to send messages and displays contact information (email, phone, location) in a two-column layout.",
  "frontend/src/pages/ContentBrowserPage.tsx": "Main content browsing interface showing semesters, subjects, chapters, and study materials (PDFs, notes, videos, links, galleries) with subscription-based access control and admin features.",
  "frontend/src/pages/DashboardPage.tsx": "User dashboard displaying subscription status with active/inactive badges, learning progress overview, and prompts to subscribe or manage subscription based on current status.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, features grid showcasing study resources (PDFs, videos, quizzes, images), pricing card (₹5/week), and testimonials section for diploma engineering students.",
  "frontend/src/pages/LeaderboardPage.tsx": "Protected page displaying user rankings with score, downloads, and quiz stats; includes tabs for weekly/monthly/all-time leaderboards and user's current rank card.",
  "frontend/src/pages/LoginPage.tsx": "Authentication page with Internet Identity login and disabled password login form; redirects admins to admin dashboard and regular users to user dashboard after successful login.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment failure confirmation page showing error message for payment to phone number 9392412728 with retry and contact support options.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success confirmation page displaying ₹5 weekly subscription details, unlocked content types (PDFs, videos, images, links), and call-to-action to start exploring materials.",
  "frontend/src/pages/ProfilePage.tsx": "Protected user profile page showing account information (email, roll number, join date), statistics (downloads, quiz average, study hours), and edit profile option.",
  "frontend/src/pages/QuizListPage.tsx": "Displays a grid of available quizzes with details like subject, duration, and completion status. Redirects unauthenticated users to login and allows navigation to individual quiz pages.",
  "frontend/src/pages/QuizPage.tsx": "Renders an individual quiz interface with a timer, progress bar, and multiple-choice question with radio button options. Includes navigation between questions and requires authentication.",
  "frontend/src/pages/RemindersPage.tsx": "Manages study reminders with a list view and dialog for creating new reminders (exams, assignments, study sessions) with date, time, and notes. Requires authentication and displays reminders with color-coded type badges.",
  "frontend/src/pages/SubscriptionPage.tsx": "Handles subscription management with PhonePe payment integration, manual payment confirmation via QR code, and displays payment history. Shows subscription status alerts and requires authentication for payment actions.",
  "frontend/src/utils/fileValidation.ts": "Utility functions for validating file uploads including size limits (50MB for files, 100MB for videos), file type checking, and formatting file sizes and upload speeds.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes, container settings, border radius variables, custom shadows, animations, and typography plugin integration.",
  "project_state.json": "Project state tracking file documenting PhonePe payment integration features, including pending requests to update UPI ID to '9392412728-2@axl' and hide/obscure it in the UI."
}