{
  "backend/main.mo": "Main backend actor implementing user profiles, lessons, withdrawal requests with phone numbers, Stripe payment integration, access control, and blob storage mixins. Includes MCF phone number (9392412728) for payment receipts.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: PhonePe QR code display, payment instructions for UPI apps, and payment confirmation workflow mentioning phone number 9392412728.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files including payment pages, subscription page with QR code, admin dashboard with withdrawal management, and styling configurations using warm educational color palette.",
  "frontend/index.css": "Global CSS with Tailwind directives and custom design system using OKLCH color space for light and dark modes with warm educational color palette.",
  "frontend/index.html": "HTML entry point for the Diploma Smart Study Hub application with root div and module script reference.",
  "frontend/src/App.tsx": "Main React app component configuring TanStack Router with routes for all pages (home, branches, subscription, admin, payment, etc.) wrapped in ThemeProvider and Layout with Toaster.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with logo, quick links, resources navigation, social media icons, and copyright information organized in a four-column grid layout.",
  "frontend/src/components/layout/Header.tsx": "Main navigation header component with logo, navigation links, theme toggle, notifications, and user authentication dropdown menu using Internet Identity.",
  "frontend/src/components/layout/Layout.tsx": "Root layout component that wraps pages with Header, main content area (Outlet), and Footer in a flex column structure.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token from URL params.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useWithdrawal.ts": "React Query hooks for withdrawal operations including submitting withdrawal requests (with validation for amount and phone number) and fetching withdrawal request data.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette using CSS variables for light/dark themes, featuring warm educational colors (sage green, terracotta, amber) and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AboutPage.tsx": "About page describing the platform's mission to provide affordable diploma study resources, featuring mission statement and four feature cards highlighting content, learning, community, and recognition.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard page showing wallet summary with earnings and balance, withdrawal request functionality with phone number validation, and navigation to other admin features. Includes dialogs for withdrawal submission and confirmation.",
  "frontend/src/pages/admin/ContentManagementPage.tsx": "Admin page for uploading and managing study materials with tabs for upload and management. Provides form inputs for selecting branch, semester, subject, and chapter when adding content.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Admin page with tabs for viewing all registered users and pending payment approvals. Displays user tables with details like name, email, roll number, branch, status, and action buttons for user management.",
  "frontend/src/pages/BranchSelectionPage.tsx": "Branch selection page displaying six engineering diploma branches (CSE, ECE, EEE, Mechanical, Civil, Other) as cards with icons, descriptions, and links to branch-specific content.",
  "frontend/src/pages/CertificatesPage.tsx": "Displays user's earned certificates with mock data including course completions, achievements, and monthly awards. Requires authentication and allows downloading certificates.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with name, email, and message fields, plus static contact information display. Shows success toast on form submission.",
  "frontend/src/pages/ContentBrowserPage.tsx": "Branch-specific content browser with semester tabs showing subjects and study materials (PDFs, videos, links). Requires authentication and uses branch parameter from route.",
  "frontend/src/pages/DashboardPage.tsx": "User dashboard showing subscription status, quick stats (downloads, quiz scores, study time, certificates), and learning progress. Requires authentication.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section promoting diploma study resources at ₹5/week, feature cards highlighting chapter-wise materials, branch coverage, quizzes, and study reminders.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays ranked list of top users by score with weekly/monthly/all-time tabs, showing user's own rank and stats (downloads, quizzes). Requires authentication.",
  "frontend/src/pages/LoginPage.tsx": "Login page component with Internet Identity and password authentication forms, including email/password validation and error handling. Redirects authenticated users to dashboard.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment failure page displaying an error message for failed payments to phone number 9392412728, with options to retry or contact support.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success page confirming ₹5 subscription payment initiation to phone number 9392412728, with instructions to complete QR code payment and links to dashboard/materials.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page displaying account information (email, roll number, join date), statistics (downloads, quiz average, study hours), and achievements with edit profile functionality.",
  "frontend/src/pages/QuizListPage.tsx": "Quiz listing page showing available quizzes with details (questions count, duration, completion status, scores) and links to start or retake quizzes.",
  "frontend/src/pages/QuizPage.tsx": "Quiz taking page displaying individual questions with multiple-choice radio button options, progress tracking, timer, and navigation between questions.",
  "frontend/src/pages/RemindersPage.tsx": "Study reminders management page with list of reminders (exams, assignments, study sessions) and dialog form to create new reminders with title, type, date, time, and notes.",
  "frontend/src/pages/SubscriptionPage.tsx": "Displays a subscription pricing page with a weekly plan for ₹5, showing features like study materials access, quizzes, and leaderboards. Includes payment method options (UPI, card, QR code) and handles subscription flow with authentication checks.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing. Includes sessionStorage persistence helpers and functions to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, container settings, custom font families (Inter, Georgia), border radius variables, and animation keyframes for accordion components.",
  "project_state.json": "Project state file documenting a full-stack educational platform for Diploma students with features including user authentication (Gmail + Roll Number), ₹5/week subscription system, UPI payment integration (phone 9392412728), admin content management, and wallet system with ₹50 minimum withdrawal threshold."
}